;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! evil-nerd-commenter)
(package! ag)
(package! cdlatex)
(package! wgrep-ag)
(package! pkgbuild-mode)
(package! zotelo)
(package! google-c-style)
(package! org-mu4e :disable t)
(package! evil-snipe :disable t)
(package! evil-commentary :disable t)
(package! company-prescient :disable t)
